Building a Robot that I. designed

** Dev environment setup

I've gotten the ESP32 plugged in with a data-enabled cable. We can see it

#+begin_src shell
  ls -l /dev/ttyUSB0
#+end_src

#+RESULTS:
: crw-rw---- 1 root dialout 188, 0 Jun 18 20:39 /dev/ttyUSB0

This is a linux convention and we need to add ourselves to the dialout group

#+begin_src shell :results silent :prologue ""
  sudo usermod -aG dialout gmauer
#+end_src

NOTE that this only takes effect after a call to ~setgroups()~ which typically happens during login. For that reason, I'm calling it directly with ~newgrp dialout~ as part of every shell block. That can be removed from our header args if need me

Sounds like we need espflash if we want to use rust to flash the esp32

#+begin_src shell :results silent
  cargo install espflash --locked
#+end_src

#+begin_src shell
  espflash board-info
#+end_src

#+RESULTS:
#+begin_example
Chip type:         esp32c3 (revision v1.1)
Crystal frequency: 40 MHz
Flash size:        4MB
Features:          WiFi, BLE
MAC address:       a0:f2:62:0c:84:88

Security Information:
=====================
Flags: 0x00000000 (0)
Key Purposes: [0, 0, 0, 0, 0, 0, 12]
Chip ID: 5
API Version: 7
Secure Boot: Disabled
Flash Encryption: Disabled
SPI Boot Crypt Count (SPI_BOOT_CRYPT_CNT): 0x0

#+end_example

So the board is an *ESP32-C3* (RISC-V core), as ordered. Note the bridge chip is a CP210x (showing up as =/dev/ttyUSB0=) rather than the native USB you'd expect on some C3 boards -- doesn't matter, the fact that it works is what counts.

Why the C3 being RISC-V matters for Rust: it uses the *stock upstream Rust* toolchain (target =riscv32imc-unknown-none-elf=). The older Xtensa ESP32 would have required Espressif's forked compiler via =espup=. We dodged that.

*** Flashing it

=esp-generate= wired =cargo run= to flash via espflash (see =.cargo/config.toml= runner) and then open the serial monitor, so flashing is just =cargo run= from inside =firmware/=. First build is slow (compiles the whole HAL); later ones are quick.

#+begin_src shell :dir firmware-blinker
    cargo run --release 2>&1
#+end_src

#+RESULTS:
#+begin_example
    Finished `release` profile [optimized + debuginfo] target(s) in 0.06s
     Running `espflash flash --monitor --chip esp32c3 --log-format defmt target/riscv32imc-unknown-none-elf/release/firmware`
[2026-06-19T04:07:35Z INFO ] Serial port: '/dev/ttyUSB0'
[2026-06-19T04:07:35Z INFO ] Connecting...
[2026-06-19T04:07:35Z INFO ] Using flash stub
Chip type:         esp32c3 (revision v1.1)
Crystal frequency: 40 MHz
Flash size:        4MB
Features:          WiFi, BLE
MAC address:       a0:f2:62:0c:84:88
App/part. size:    93,248/4,128,768 bytes, 2.26%
[2026-06-19T04:07:39Z INFO ] Flashing has completed!
Commands:
    CTRL+R    Reset chip
    CTRL+C    Exit

ESP-ROM:esp32c3-eco7-20230720
Error:   × Failed to initialize input reader

#+end_example

and boom, blinking

